[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@当前个案的顺序号。对于每个个案，$CASENUM 为包括此个案在内的可读取的最大个案数量。其格式为 F8.0。$CASENUM 的值不必为数据编辑器窗口（存在于窗口环境）的行号，但如果文件已排列或者新个案已在文件末尾前插入，值将发生变化。
$sysmis10=10@$Sysmis@$SYSMIS@系统缺失值。系统缺失值显示为句点 (.) 或用作小数指示符的符号。
$date4=4@$Date@$DATE@采用两位数年份的国际日期格式的当前日期。格式为 dd-mmm-yy 表格中的 A9。
$jdate4=4@$JDate@$JDATE@从 1582 年 10 月 14 日（阳历第一天）开始计算天数的当前日期。格式为 F6.0。
$date114=4@$Date11@$DATE11@采用四位数年份的国际日期格式的当前日期。格式为 dd-mmm-yyyy 表格中的 A11。
$time4=4@$Time@$TIME@当前日期和时间。$TIME 表示从 1582 年 10 月 14 日午夜到执行转换命令的日期和时间所经过的秒数。格式为 F20。您可以将此显示为多种不同日期格式的日期。您也可以将其用于日期和时间函数。
abs1=1@Abs@ABS(?)@ABS(numexpr)。数值。返回 numexpr 的绝对值，必须为数值。
any13=13@Any@ANY(?,?)@ANY(test,value[,value,...])。逻辑值。如果检验的值与任何后续值相匹配，则返回 1 或 true；否则返回 0 或 false。此函数需要两个或更多参数。例如，如果 var1 的值是 1、3 或 5，则 ANY(var1, 1, 3, 5) 返回 1；对于其他值则返回 0。ANY 还可以用于扫描变量列表或值的表达式。例如，如果三个指定变量中的任意一个的值为 1，则 ANY(1, var1, var2, var3) 返回 1；如果所有三个变量的值都不为 1，则 ANY(1, var1, var2, var3) 返回 0。
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value).数值。使用句柄指定的模型将特定得分函数应用于输入个案数据，其中“function”是以下字符串文本值之一，以引号括起：predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance.模型句柄是与外部 XML 文件相关联的名称，在 MODEL HANDLE 命令中定义。当功能是“概率”、“邻元素”或“距离”时，应用可选第三参数。对于“概率”，其指定为其计算概率的类别。对于“邻元素”和“距离”，其指定最近相邻模型的特定邻元素（作为整数）。如果无法计算值，则 ApplyModel 返回系统缺失值。
arsin1=1@Arsin@ARSIN(?)@ARSIN(numexpr)。数值。返回 numexpr 的反正弦 (arcsine)（以弧度表示），求出的值必须为 -1 和 +1 之间的数值。
artan1=1@Artan@ARTAN(?)@ARTAN(numexpr)。数值。返回 numexpr 的反正切 (arctangent)（以弧度表示），必须为数值。
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(quant, prob)。数值。返回 Bernoulli 分布（给定了概率参数）中的值将小于等于 quant 的累积概率。
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(quant, shape1, shape2)。数值。返回 Beta 分布（给定了形状参数）中的值将小于 quant 的累积概率。
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(quant, n, prob)。数值。返回 n 次试验（每次成功的概率为 prob）中成功次数将小于等于 quant 的累积概率。当 n 为 1 时，这等同于 CDF.BERNOULLI。
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, corr)。数值。返回标准双变量正态分布（给定了相关参数）中的值将小于 quant1 和 quant2 的累积概率。
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(quant, loc, scale)。数值。返回 Cauchy 分布（给定了位置和尺度参数）中的值将小于 quant 的累积概率。
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(quant, df)。数值。返回卡方分布（自由度为 df）中的值将小于 quant 的累积概率。
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(quant, scale)。数值。返回指数分布（给定了尺度参数）中的值将小于 quant 的累积概率。
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(quant, df1, df2)。数值。返回 F 分布（自由度为 df1 和 df2）中的值将小于 quant 的累积概率。
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(quant, shape, scale)。数值。返回 Gamma 分布（给定了形状和尺度参数）中的值将小于 quant 的累积概率。
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(quant, prob)。数值。返回获得成功（成功概率由 prob 给出时）的试验次数将小于等于 quant 的累积概率。
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(quant, mean, stddev)。数值。返回半正态分布（指定了均值和标准差）中的值将小于 quant 的累积概率。
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(quant, total, sample, hits)。数值。返回具有指定特征的对象数量（在命中对象有指定特征、大小为 total 的总体中随机选择样本对象时）将小于等于 quant 的累积概率。
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(quant, loc, scale)。数值。返回逆高斯分布（给定了位置和尺度参数）中的值将小于 quant 的累积概率。
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(quant, mean, scale)。数值。返回 Laplace 分布（给定了均值和尺度参数）中的值将小于 quant 的累积概率。
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(quant, a, b)。数值。返回对数正态分布（指定了参数）中的值将小于 quant 的累积概率。
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(quant, mean, scale)。数值。返回 logistic 分布（给定了均值和尺度参数）中的值将小于 quant 的累积概率。
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(quant, thresh, prob)。数值。返回获得成功（阈值参数是 thresh 且成功的概率由 prob 给出时）的试验次数将小于等于 quant 的累积概率。
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(quant, mean, stddev)。数值。返回正态分布（指定了均值和标准差）中的值将小于 quant 的累积概率。
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(quant, threshold, shape)。数值。返回 Pareto 分布（指定了阈值和形状参数）中的值将小于 quant 的累积概率。
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(quant, mean)。数值。返回泊松分布（指定了均值或比率参数）中的值将小于等于 quant 的累积概率。
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(quant, a, b)。数值。返回学生化的最大模数（指定了参数）中的值将小于 quant 的累积概率。
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(quant, a, b)。数值。返回学生化范围统计量（指定了参数）中的值将小于 quant 的累积概率。
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(quant, df)。数值。返回学生化 t 分布（指定自由度为 df）中的值将小于 quant 的累积概率。
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(quant, min, max)。数值。返回均匀分布（指定了最小值和最大值）中的值将小于 quant 的累积概率。
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(quant, a, b)。数值。返回 Weibull 分布（指定了参数）中的值将小于 quant 的累积概率。
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zvalue)。数值。返回均值为 0 且标准差为 1 的随机变量将小于 zvalue（必须为数值型）的概率。
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(numexpr,numexpr[,...])。数值。返回其具有有效值的参数的变异系数（标准差除以均值）。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。数值。返回指示 haystack 中第一次出现 needle 的字符位置的数字。可选的第三个参数 divisor 是用于将 needle 划分为单独字符串的字符数。每个子字符串用于进行搜索，函数返回第一个出现的任何子字符串。例如，CHAR.INDEX(var1, 'abcd') 将返回字符串变量 var1 中完整的字符串“abcd”的起始位置的值；CHAR.INDEX(var1, 'abcd', 1) 将返回第一次出现字符串中任意值的位置的值；CHAR.INDEX(var1, 'abcd', 2) 将返回第一次出现“ab”或“cd”的位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果 needle 未出现在 haystack 中，则返回 0。
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。数值。返回指示 haystack 中第一次出现 needle 的字符位置的数字。可选的第三个参数 divisor 是用于将 needle 划分为单独字符串的字符数。每个子字符串用于进行搜索，函数返回第一个出现的任何子字符串。例如，CHAR.INDEX(var1, 'abcd') 将返回字符串变量 var1 中完整的字符串“abcd”的起始位置的值；CHAR.INDEX(var1, 'abcd', 1) 将返回第一次出现字符串中任意值的位置的值；CHAR.INDEX(var1, 'abcd', 2) 将返回第一次出现“ab”或“cd”的位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果 needle 未出现在 haystack 中，则返回 0。
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。数值。返回指示 haystack 中第一次出现 needle 的字符位置的数字。可选的第三个参数 divisor 是用于将 needle 划分为单独字符串的字符数。每个子字符串用于进行搜索，函数返回第一个出现的任何子字符串。例如，CHAR.INDEX(var1, 'abcd') 将返回字符串变量 var1 中完整的字符串“abcd”的起始位置的值；CHAR.INDEX(var1, 'abcd', 1) 将返回第一次出现字符串中任意值的位置的值；CHAR.INDEX(var1, 'abcd', 2) 将返回第一次出现“ab”或“cd”的位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果 needle 未出现在 haystack 中，则返回 0。
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。数值。返回指示 haystack 中第一次出现 needle 的字符位置的数字。可选的第三个参数 divisor 是用于将 needle 划分为单独字符串的字符数。每个子字符串用于进行搜索，函数返回第一个出现的任何子字符串。例如，CHAR.INDEX(var1, 'abcd') 将返回字符串变量 var1 中完整的字符串“abcd”的起始位置的值；CHAR.INDEX(var1, 'abcd', 1) 将返回第一次出现字符串中任意值的位置的值；CHAR.INDEX(var1, 'abcd', 2) 将返回第一次出现“ab”或“cd”的位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果 needle 未出现在 haystack 中，则返回 0。
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(strexpr)。数值。返回 strexpr 的字符长度且任何拖尾空格已删除。
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。字符串。使用尽可能多拟合 strexpr2 的完整副本作为填充字符串向左填充 strexpr1 以使其长度达到 length 所指定的值。长度的值代表字符数且必须为正整数。如果省略可选参数 strexpr2，则会用空格填充值。
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。字符串。使用尽可能多拟合 strexpr2 的完整副本作为填充字符串向左填充 strexpr1 以使其长度达到 length 所指定的值。长度的值代表字符数且必须为正整数。如果省略可选参数 strexpr2，则会用空格填充值。
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(strexpr,pos)。数值。返回在 strexpr 的字符位置 pos 处的字符中的字节数。
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数值。返回一个整数，指示字符串 needle 最后一次出现在字符串 haystack 中的起始字符位置。可选的第三个参数 divisor 是用于将 needle 划分为单独的字符串的字符数。例如，CHAR.RINDEX(var1, 'abcd') 将返回整个字符串“abcd”在变量 var1 中最后一次出现的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 将返回字符串中任意值最后一次出现的位置的值；CHAR.RINDEX(var1, 'abcd', 2) 将返回“ab”或“cd”最后一次出现的起始位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果未找到 needle，则返回值 0。
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数值。返回一个整数，指示字符串 needle 最后一次出现在字符串 haystack 中的起始字符位置。可选的第三个参数 divisor 是用于将 needle 划分为单独的字符串的字符数。例如，CHAR.RINDEX(var1, 'abcd') 将返回整个字符串“abcd”在变量 var1 中最后一次出现的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 将返回字符串中任意值最后一次出现的位置的值；CHAR.RINDEX(var1, 'abcd', 2) 将返回“ab”或“cd”最后一次出现的起始位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果未找到 needle，则返回值 0。
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数值。返回一个整数，指示字符串 needle 最后一次出现在字符串 haystack 中的起始字符位置。可选的第三个参数 divisor 是用于将 needle 划分为单独的字符串的字符数。例如，CHAR.RINDEX(var1, 'abcd') 将返回整个字符串“abcd”在变量 var1 中最后一次出现的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 将返回字符串中任意值最后一次出现的位置的值；CHAR.RINDEX(var1, 'abcd', 2) 将返回“ab”或“cd”最后一次出现的起始位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果未找到 needle，则返回值 0。
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数值。返回一个整数，指示字符串 needle 最后一次出现在字符串 haystack 中的起始字符位置。可选的第三个参数 divisor 是用于将 needle 划分为单独的字符串的字符数。例如，CHAR.RINDEX(var1, 'abcd') 将返回整个字符串“abcd”在变量 var1 中最后一次出现的起始位置；CHAR.RINDEX(var1, 'abcd', 1) 将返回字符串中任意值最后一次出现的位置的值；CHAR.RINDEX(var1, 'abcd', 2) 将返回“ab”或“cd”最后一次出现的起始位置的值。Divisor 必须是正整数并且必须均匀分割 needle 长度。如果未找到 needle，则返回值 0。
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。字符串。使用 strexpr2 向右填充 strexpr1，以将其延伸到 length 所给定的长度，该长度使用同填充字符串一样多的完整副本，这些副本将拟合 strexpr2。长度的值代表字符数且必须为正整数。可选的第三个参数 strexpr2 是一个用引号引起的字符串或一个解析为字符串的表达式。如果省略 strepxr2，则会用空格填充值。
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。字符串。使用 strexpr2 向右填充 strexpr1，以将其延伸到 length 所给定的长度，该长度使用同填充字符串一样多的完整副本，这些副本将拟合 strexpr2。长度的值代表字符数且必须为正整数。可选的第三个参数 strexpr2 是一个用引号引起的字符串或一个解析为字符串的表达式。如果省略 strepxr2，则会用空格填充值。
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(strexpr,pos[,length])。字符串。返回 strexpr 中从字符位置 pos 开始的子字符串。可选的第三个参数代表子字符串中的字符数。如果省略可选的参数 length，则返回从 strexpr 的 pos 字符位置开始一直到 strexpr 结尾的子字符串。例如，CHAR.SUBSTR('abcd', 2) 返回“bcd”；CHAR.SUBSTR('abcd', 2, 2) 返回“bc”。
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(strexpr,pos[,length])。字符串。返回 strexpr 中从字符位置 pos 开始的子字符串。可选的第三个参数代表子字符串中的字符数。如果省略可选的参数 length，则返回从 strexpr 的 pos 字符位置开始一直到 strexpr 结尾的子字符串。例如，CHAR.SUBSTR('abcd', 2) 返回“bcd”；CHAR.SUBSTR('abcd', 2, 2) 返回“bc”。
concat16=16@Concat@CONCAT(?,?)@CONCAT(strexpr,strexpr[,..])。字符串。返回由其全部参数拼接而成的字符串，对其求出的值必须为字符串。此函数需要两个或更多参数。在代码页模式中，如果 strexpr 是字符串变量，并且您只需要实际字符串值，而不向右填充到已定义的变量宽度，则请使用 RTRIM。例如，CONCAT(RTRIM(stringvar1) 和 RTRIM(stringvar2))。
cos1=1@Cos@COS(?)@COS(radians)。数值。返回 radians（必须为数字值，以弧度度量）的余弦。
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(timevalue)。数值。返回 timevalue 中的天数（包括小数天数），timevalue 可以是秒数、时间表达式或时间格式的变量。
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(timevalue)。数值。返回 timevalue 中的小时数（包括小数小时数），timevalue 可以是秒数、时间表达式或时间格式的变量。
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(timevalue)。数值。返回 timevalue 中的分钟数（包括分数分钟数），timevalue 可以是秒数、时间表达式或时间格式的变量。
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(timevalue)。数值。返回 timevalue 中的秒数（包括小数秒数），timevalue 可以是数字、时间表达式或时间格式的变量。
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(day,month,year)。数值。返回对应于所指 day、month 和 year 的日期值。这些参数必须解析为整数，日的范围为 1 到 31，月的范围为 1 到 13，年为大于 1582 的四位整数。要将结果显示为日期，请将结果变量指定为日期格式。
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(month,day,year)。数值。返回对应于所指 month、day 和 year 的日期值。这些参数必须解析为整数，日的范围为 1 到 31，月的范围为 1 到 13，年为大于 1582 的四位整数。要将结果显示为日期，请将结果变量指定为日期格式。
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(month,year)。数值。返回对应于所指 month 和 year 的日期值。这些参数必须解析为整数，month 的范围为 1 到 13，year 为大于 1582 的四位整数。若要将结果显示为日期，请将结果变量指定为日期格式。
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(quarter,year)。数值。返回对应于所指 quarter 和 year 的日期值。这些参数必须解析为整数，quarter 的范围为 1 到 4，year 为大于 1582 的四位整数。若要将结果显示为日期，请将结果变量指定为日期格式。
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(weeknum,year)。数值。返回对应于所指 weeknum 和 year 的日期值。这些参数必须解析为整数，weeknum 的范围为 1 到 53，year 为大于 1582 的四位整数。返回的日期值表示当年指定星期的第一天。第一个星期从每年的 1 月 1 日开始。因此为任何给定星期值返回的日期随不同年而不同。若要将结果显示为日期，请将结果变量指定为日期格式。
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(year,daynum)。数值。返回对应于所指 year 和 daynum 的日期值。这些参数必须解析为整数，daynum 的范围为 1 到 366，year 为大于 1582 的四位整数。若要将结果显示为日期，请为结果变量指定日期格式。
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit")。数值。计算两个日期/时间值之间的差额，并返回一个整数（舍去小数部分）（采用指定日期/时间单位），其中 datetime2 及 datetime1 均为日期或时间格式变量（或表示有效日期/时间值的数值），而“unit”为用引号括起来的以下其中一个字符串字面值：年、季、月、周、日、小时、分钟、秒。
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method")。数值。以来自给定日期或时间值的指定数目的单位计算日期或时间值，其中 datetime 为日期或时间格式变量（或表示有效日期/时间值的数值），而“unit”为用引号括起来的以下其中一个字符串字面值：年、季、月、周、日、小时、分钟、秒。可选方法（以引号括起）有“rollover”或“closest”。rollover 方法将多余的天数前移到下个月。closest 方法使用月中最接近的合法日期，这是默认值。返回的值是以秒数表示的日期/时间值。要以日期/时间显示值，请向变量分配适当的格式。
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method")。数值。以来自给定日期或时间值的指定数目的单位计算日期或时间值，其中 datetime 为日期或时间格式变量（或表示有效日期/时间值的数值），而“unit”为用引号括起来的以下其中一个字符串字面值：年、季、月、周、日、小时、分钟、秒。可选方法（以引号括起）有“rollover”或“closest”。rollover 方法将多余的天数前移到下个月。closest 方法使用月中最接近的合法日期，这是默认值。返回的值是以秒数表示的日期/时间值。要以日期/时间显示值，请向变量分配适当的格式。
exp1=1@Exp@EXP(?)@EXP(numexpr)。数值。返回 e 的 numexpr 次幂，其中 e 是自然对数的底，而 numexpr 为数值。过大的 numexpr 值所产生的结果可能会超过计算机的容量。
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(prob, shape1, shape2)。数值。返回具有给定形状参数的 Beta 分布中累积概率为 prob 的值。
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, scale)。数值。返回具有给定位置和刻度参数的 Cauchy 分布中累积概率为 prob 的值。
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(prob, df)。数值。返回指定自由度为 df 的卡方分布中累积概率为 prob 的值。例如，显著水平为 0.05、自由度为 3 的卡方值为 IDF.CHISQ(0.95,3)。
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, scale)。数值。返回带有衰减速率标度的指数衰减变量累积概率为 p 的值。
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(prob, df1, df2)。数值。返回指定自由度的 F 分布中累积概率为 prob 的值。例如，显著水平为 0.05、自由度为 3 和 100 的 F 值为 IDF.F(0.95,3,100)。
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(prob, shape, scale)。数值。以指定的 shape 和 scale 参数从 Gamma 分布中返回累积概率为 prob 的值。
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(prob, mean, stddev)。数值。以指定的均值和标准差从半正态分布中返回累积概率为 prob 的值。
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(prob, loc, scale)。数值。以给定的位置和刻度参数从逆高斯分布中返回累积概率为 prob 的值。
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(prob, mean, scale)。数值。返回具有指定均值和刻度参数的 Laplace 分布中累积概率为 prob 的值。
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(prob, a, b)。数值。返回具有指定参数的对数正态分布中累积概率为 prob 的值。
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(prob, mean, scale)。数值。返回具有指定均值和刻度参数的 logistic 分布中累积概率为 prob 的值。
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(prob, mean, stddev)。数值。返回具有指定均值和标准差的正态分布中累积概率为 prob 的值。
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(prob, threshold, shape)。数值。以指定的阈值和刻度参数从 Pareto 分布中返回累积概率为 prob 的值。
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(prob, a, b)。数值。以指定参数根据学生化的最大模数返回累积概率为 prob 的值。
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(prob, a, b)。数值。以指定的参数从学生化的范围统计返回累积概率是 prob 的值。
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(prob, df)。数值。返回指定自由度为 df 的学生式 t 分布中累积概率为 prob 的值。
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(prob, min, max)。数值。返回在最小值和最大值之间的均匀分布中累积概率为 prob 的值。
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(prob, a, b)。数值。返回具有指定参数的 Weibull 分布中累积概率为 prob 的值。
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n])。数值或字符串。前一个案或前 n 个个案中的变量的值。可选的第二个参数 n 必须为正整数；默认值是 1。例如，prev4=LAG(gnp,4) 返回当前个案之前的第四个个案的 gnp 值。前四个个案的 prev4 为系统缺失值。
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n])。数值或字符串。前一个案或前 n 个个案中的变量的值。可选的第二个参数 n 必须为正整数；默认值是 1。例如，prev4=LAG(gnp,4) 返回当前个案之前的第四个个案的 gnp 值。前四个个案的 prev4 为系统缺失值。
length16=16@Length@LENGTH(?)@LENGTH(strexpr)。数值。返回 strexpr 的字节长度，strexpr 必须是一个字符串表达式。对于字符串变量， 在 Unicode 模式中，这是每个值的字节数，不包括尾部的空格，但在代码页模式中，这是定义的变量长度，包括尾部的空格。若要获取代码页模式中不带脱尾空格时的长度（字节），请使用 LENGTH(RTRIM(strexpr))。
lg101=1@Lg10@LG10(?)@LG10(numexpr)。数值。返回以 10 为底数的 numexpr 的对数，numexpr 必须为大于 0 的数字。
ln1=1@Ln@LN(?)@LN(numexpr)。数值。返回以 e 为底数的 numexpr 的对数，numexpr 必须为大于 0 的数字。
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(numexpr)。数值。返回 numexpr 的完全 Gamma 函数的对数，numexpr 必须为大于 0 的数字。
lower16=16@Lower@LOWER(?)@LOWER(strexpr)。字符串。返回 strexpr，同时大写字母都更改为小写字母而其他字符不变。该参数可以是一个字符串变量或一个值。例如，如果 name1 的值为 Charles，则 LOWER(name1) 返回 charles。
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(strexpr[,char])。字符串。返回包含移去的 char 的任何前导实例的 strexpr。如果不指定 char，则会移去前导空格。Char 必须解析为单个字符。
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(strexpr[,char])。字符串。返回包含移去的 char 的任何前导实例的 strexpr。如果不指定 char，则会移去前导空格。Char 必须解析为单个字符。
max13=13@Max@MAX(?,?)@MAX(value,value[,..])。数值或字符串。返回其具有有效值的参数的最大值。此函数需要两个或更多参数。对于数值，您可以指定有效参数的最小数目，以对此函数求值。
max15=15@Max@MAX(?,?)@MAX(value,value[,..])。数值或字符串。返回其具有有效值的参数的最大值。此函数需要两个或更多参数。对于数值，您可以指定有效参数的最小数目，以对此函数求值。
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(strexpr,pos)。数值。返回在 strexpr 的字节位置 pos 处的字符中的字节数。
mean15=15@Mean@MEAN(?,?)@MEAN(numexpr,numexpr[,..])。数值。返回其具有有效的、非缺失值的参数的算术均值。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
median15=15@Median@Median(?,?)@MEDIAN(numexpr,numexpr[,..])。数值。返回其具有有效的、非缺失值的参数的中位数（第 50 个百分位）。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
min13=13@Min@MIN(?,?)@MIN(value,value[,..])。数值或字符串。返回其具有有效非缺失值的参数的最小值。此函数需要两个或更多参数。对于数值，您可以指定有效参数的最小数目，以对此函数求值。
min15=15@Min@MIN(?,?)@MIN(value,value[,..])。数值或字符串。返回其具有有效非缺失值的参数的最小值。此函数需要两个或更多参数。对于数值，您可以指定有效参数的最小数目，以对此函数求值。
missing10=10@Missing@MISSING(?)@MISSING(variable)。逻辑值。如果变量具有系统缺失值或用户缺失值，则返回 1 或 true。参数应为活动数据集中的变量名。
mod1=1@Mod@MOD(?,?)@MOD(numexpr,modulus)。数值。返回 numexpr 除以 modulus 所得到的余数。两个参数必须都是数值，且 modulus 不得为 0。
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(quant, shape1, shape2, nc)。数值。返回具有给定形状和非中心性参数的非中心 Beta 分布中的值小于 quant 的累积概率。
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(quant, df, nc)。数值。返回具有自由度 df 和指定非中心性参数的非中心卡方分布中的值小于 quant 的累积概率。
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(quant, df1, df2, nc)。数值。返回具有自由度 df1 和 df2 和非中心性 nc 的 F 分布中的值小于 quant 的累积概率。
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(quant, df, nc)。数值。返回具有指定自由度 df 和非中心性 nc 的 Student t 分布中的值小于 quant 的累积概率。
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..])。数值。返回具有系统缺失值和用户缺失值的参数的计数。此函数需要一个或多个参数，这些参数应为活动数据集中的变量名。
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp)。字符串。返回 strexp 标准化版本。Unicode 模式下，返回 Unicode NFC。代码页模式下，无效应并返回未修改的 strexp。结果长度可能与输入长度不同。
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(quant, shape1, shape2, nc)。数值。以给定形状和非中心性参数返回处于 quant 的非中心 beta 分布的概率密度。
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(quant, df, nc)。数值。以自由度 df 和指定的非中心性参数返回处于 quant 的非中心卡方分布的概率密度。
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(quant, df1, df2, nc)。数值。以自由度 df1 和 df2 以及非中心性 nc 返回处于 quant 的非中心 F 分布的概率密度。
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(quant, df, nc)。数值。返回具有指定自由度 df 及非中心 nc 的非中心 Student t 分布在 quant 处的概率密度。
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname)。返回 varname 值，不用删除拖尾空格。varname 的值必须是一个变量名，不可以是一个表达式。
number3=3@Number@NUMBER(?,?)@NUMBER(strexpr,format)。数值。以数字形式返回字符串表达式 strexpr 的值。第二个参数 format 是用于读取 strexpr 的数值格式。例如，NUMBER(stringDate,DATE11) 将包含一般格式 dd-mmm-yyyy 日期的字符串转换为代表该日期的秒数的数字。（若要将值显示为日期，则请使用 FORMATS 或 PRINT FORMATS 命令。）如果无法使用此格式读取该字符串，则此函数将返回系统缺失值。
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable[,..])。数值。返回有着有效非缺失值的参数的计数。此函数需要一个或多个参数，这些参数应为活动数据集中的变量名。
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(quant, prob)。数值。以给定概率参数返回 Bernoulli 分布中的值将等于 quant 的概率。
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(quant, shape1, shape2)。数值。以给定的形状参数返回处于 quant 的 beta 分布的概率密度。
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(quant, n, prob)。数值。返回当每次试验的成功概率是 prob 时，n 次试验中的成功次数将等于 quant 的概率。当 n 为 1 时，这等同于 PDF.BERNOULLI。
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr)。数值。以给定的相关性参数返回处于 quant1 和 quant2 的标准双元正态分布的概率密度。
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale)。数值。以给定的位置和刻度参数返回处于 quant 的 Cauchy 分布的概率密度。
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(quant, df)。数值。以 df 自由度返回处于 quant 的卡方分布的概率密度。
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(quant, shape)。数值。以给定的 shape 参数返回处于 quant 的指数分布的概率密度。
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(quant, df1, df2)。数值。以自由度 df1 和 df2 返回处于 quant 的 F 分布的概率密度。
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale)。数值。以给定的 shape 和 scale 参数返回处于 quant 的 gamma 分布的概率密度。
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(quant, prob)。数值。返回在由 prob 给定时成功概率下，获得成功的试验数等于 quant 的概率。
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev)。数值。以指定的均值和标准差返回处于 quant 的半正态分布的概率密度。
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits)。数值。如果样本对象是从 hits 具有指定特征、大小为 total 的全体中随机选择的，则返回具有指定特征的对象的数目等于 quant 的概率。
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale)。数值。以给定的位置和尺度参数返回处于 quant 的高斯分布的概率密度。
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale)。数值。以指定的均值和尺度参数返回处于 quant 的 Laplace 分布的概率密度。
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(quant, a, b)。数值。以指定的参数返回处于 quant 的对数正态分布的概率密度。
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale)。数值。以指定的均值和尺度参数返回处于 quant 的 logistic 分布的概率密度。
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob)。数值。当阈值参数是 thresh 且成功概率由 prob 给出时，返回获取成功时试验次数等于 quant 的概率。
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev)。数值。以指定均值和标准差返回处于 quant 的正态分布的概率密度。
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape)。数值。以指定的阈值和形状参数返回处于 quant 的 Pareto 分布的概率密度。
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean)。数值。以指定的均值或比率参数返回泊松分布中的某个值将等于 quant 的概率。
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df)。数值。返回具有指定自由度 df 的Student t 分布在 quant 处的概率密度。
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max)。数值。以指定的最小值和最大值返回处于 quant 的均匀分布的概率密度。
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b)。数值。以指定的参数返回处于 quant 的 Weibull 分布的概率密度。
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..])。逻辑值。如果 test 是在 lo、hi 对所定义的任何包含范围内，则返回 1 或 true。参数必须全部为数字或全部为字符串，长度必须相同，并且每个 lo、hi 对必须按 lo <= hi 来排序。注意：对于字符串值，由于使用了国家/地区对照顺序，即使是同一字符集，其结果也可能因语言环境不同而不同。语言顺序（而非 ASCII 顺序），决定了序列中的特定字符的位置。
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。字符串。在 a1 中，a2 的实例替换为 a3。可选参数 a4 指定要替换的实例数；如果省略 a4，则替换所有实例。参数 a1、a2 和 a3 必须解析为字符串值（用引号括起的文本字符串或字符串变量），可选参数 a4 必须解析为非负整数。例如，REPLACE("abcabc", "a", "x") 返回值“xbcxbc”；REPLACE("abcabc", "a", "x", 1) 返回值“xbcabc”。
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。字符串。在 a1 中，a2 的实例替换为 a3。可选参数 a4 指定要替换的实例数；如果省略 a4，则替换所有实例。参数 a1、a2 和 a3 必须解析为字符串值（用引号括起的文本字符串或字符串变量），可选参数 a4 必须解析为非负整数。例如，REPLACE("abcabc", "a", "x") 返回值“xbcxbc”；REPLACE("abcabc", "a", "x", 1) 返回值“xbcabc”。
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。字符串。在 a1 中，a2 的实例替换为 a3。可选参数 a4 指定要替换的实例数；如果省略 a4，则替换所有实例。参数 a1、a2 和 a3 必须解析为字符串值（用引号括起的文本字符串或字符串变量），可选参数 a4 必须解析为非负整数。例如，REPLACE("abcabc", "a", "x") 返回值“xbcxbc”；REPLACE("abcabc", "a", "x", 1) 返回值“xbcabc”。
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。字符串。在 a1 中，a2 的实例替换为 a3。可选参数 a4 指定要替换的实例数；如果省略 a4，则替换所有实例。参数 a1、a2 和 a3 必须解析为字符串值（用引号括起的文本字符串或字符串变量），可选参数 a4 必须解析为非负整数。例如，REPLACE("abcabc", "a", "x") 返回值“xbcxbc”；REPLACE("abcabc", "a", "x", 1) 返回值“xbcabc”。
rnd(1)1=1@Rnd(1)@RND(?)@RND(numexpr[,mult,fuzzbits])。数值。使用单个参数，返回最接近该参数的整数。刚好以 .5 结尾的数字被舍入为 0。例如，RND(-4.5) 舍入后为 -5。可选第二参数 mult 指定结果是此值的整数倍—例如，RND(-4.57,0.1) = -4.6。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到四舍五入的阈值（例如，当 0.5 四舍五入为整数时），但是仍然被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(numexpr[,mult,fuzzbits])。数值。使用单个参数，返回最接近该参数的整数。刚好以 .5 结尾的数字被舍入为 0。例如，RND(-4.5) 舍入后为 -5。可选第二参数 mult 指定结果是此值的整数倍—例如，RND(-4.57,0.1) = -4.6。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到四舍五入的阈值（例如，当 0.5 四舍五入为整数时），但是仍然被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(numexpr[,mult,fuzzbits])。数值。使用单个参数，返回最接近该参数的整数。刚好以 .5 结尾的数字被舍入为 0。例如，RND(-4.5) 舍入后为 -5。可选第二参数 mult 指定结果是此值的整数倍—例如，RND(-4.57,0.1) = -4.6。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到四舍五入的阈值（例如，当 0.5 四舍五入为整数时），但是仍然被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(strexpr[,char])。字符串。删除 strexpr 中 char 的尾部实例。可选的第二个参数 char 是包含在一对单引号中的单个字符，或是某个产生单个字符的表达式。如果省略 char，则会删除拖尾空格。
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(strexpr[,char])。字符串。删除 strexpr 中 char 的尾部实例。可选的第二个参数 char 是包含在一对单引号中的单个字符，或是某个产生单个字符的表达式。如果省略 char，则会删除拖尾空格。
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(prob)。数值。返回具有指定概率参数 prob 的 Bernoulli 分布中的随机值。
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(shape1, shape2)。数值。返回具有指定形状参数的 Beta 分布中的随机值。
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, prob)。数值。返回具有指定试验次数和概率参数的二项式分布中的随机值。
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, scale)。数值。返回具有指定位置和刻度参数的 Cauchy 分布中的随机值。
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df)。数值。返回具有指定自由度 df 的卡方分布中的随机值。
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(scale)。数值。返回具有指定刻度参数的指数分布中的随机值。
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1, df2)。数值。返回具有指定自由度 df1 和 df2 的 F 分布中的随机值。
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(shape, scale)。数值。返回具有指定形状和刻度参数的 Gamma 分布中的随机值。
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(prob)。数值。以指定的概率参数从几何分布中返回一个随机值。
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(mean, stddev)。数值。以指定的均值和标准差从半正态分布中返回一个随机值。
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, sample, hits)。数值。以指定的参数从超几何分布中返回一个随机值。
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, scale)。数值。以指定的位置和刻度参数从逆高斯分布中返回一个随机值。
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(mean, scale)。数值。返回具有指定均值和刻度参数的 Laplace 分布中的随机值。
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b)。数值。返回具有指定参数的对数正态分布中的随机值。
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(mean, scale)。数值。返回具有指定均值和刻度参数的 logistic 分布中的随机值。
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(threshold, prob)。数值。返回具有指定阈值和概率参数的负二项式分布中的随机值。
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(mean, stddev)。数值。返回具有指定均值和标准差的正态分布中的随机值。
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(threshold, shape)。数值。返回具有指定阈值和形状参数的 Pareto 分布中的随机值。
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(mean)。数值。返回具有指定均值/比率参数的泊松分布中的随机值。
rv.t12=12@Rv.T@RV.T(?)@RV.T(df)。数值。返回具有指定自由度 df 的 Student t 分布中的随机值。
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min, max)。数值。返回具有指定最小值和最大值的均匀分布中的随机值。另请参阅 UNIFORM 函数。
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b)。数值。返回具有指定参数的 Weibull 分布中的随机值。
sd15=15@Sd@SD(?,?)@SD(numexpr,numexpr[,..])。数值。返回其具有有效非缺失值的参数的标准差。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(quant, df)。数值。返回自由度为 df 的卡方分布中的值大于 quant 的累积概率
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(quant、df1、df2)。数值。返回 F 分布（自由度为 df1 和 df2）中的值将大于 quant 的累积概率。
sin1=1@Sin@SIN(?)@SIN(radians)。数值。返回 radians 的正弦（以弧度为单位），radians 必须为数字值。
sqrt1=1@Sqrt@SQRT(?)@SQRT(numexpr)。数值。返回 numexpr 的正平方根，numexpr 必须为非负数。
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value).字符串。使用句柄指定的模型将特定得分函数应用于输入个案数据，其中“function”是以下字符串文本值之一，以引号括起：predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance.模型句柄是与外部 XML 文件相关联的名称，在 MODEL HANDLE 命令中定义。当功能是“概率”、“邻元素”或“距离”时，应用可选第三参数。对于“概率”，其指定为其计算概率的类别。对于“邻元素”和“距离”，其指定最近相邻模型的特定邻元素（作为整数）。如果不能计算值，则 StrApplyModel 返回空字符串。
string3=3@String@STRING(?,?)@STRING(numexpr,format)。字符串。当 numexpr 根据 format 转换为字符串时，返回所产生的字符串。STRING(-1.5,F5.2) 将返回字符串值“-1.50”。第二个参数 format 必须是一种用于写数字值的格式。
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(strexp, length)。字符串。返回截断至长度（以字节为单位）的 strexp 然后删除所有拖尾空格。截断将删除任何可能被截断的字符片段。
sum15=15@Sum@SUM(?,?)@SUM(numexpr,numexpr[,..])。数值。返回具有有效的、非缺失值的参数的和。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(numvar)。逻辑值。如果 numvar 的值为系统缺失值，则返回 1 或 true。参数 numvar 必须为活动数据集中某个数值变量的名称。
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(days)。数值。返回一个对应于所指示的 days 数的时间区间。参数必须为数值。要将结果显示为时间，请将结果变量指定为时间格式。
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(hours[,minutes,seconds])。数值。返回与所指示的 hours、minutes 和 seconds 数对应的时间区间。分钟和秒参数可选。如果任何高阶参数为非零数，那么分钟和秒必须解析为小于 60 的数字。除最后非零参数外的所有参数必须解析为整数。例如 TIME.HMS(25.5) 和 TIME.HMS(0,90,25.5) 有效，而 TIME.HMS(25.5,30) 和 TIME.HMS(25,90) 则无效。所有参数都必须解析为全正或全负的值。要将结果显示为时间，请将结果变量指定为时间格式。
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(hours[,minutes,seconds])。数值。返回与所指示的 hours、minutes 和 seconds 数对应的时间区间。分钟和秒参数可选。如果任何高阶参数为非零数，那么分钟和秒必须解析为小于 60 的数字。除最后非零参数外的所有参数必须解析为整数。例如 TIME.HMS(25.5) 和 TIME.HMS(0,90,25.5) 有效，而 TIME.HMS(25.5,30) 和 TIME.HMS(25,90) 则无效。所有参数都必须解析为全正或全负的值。要将结果显示为时间，请将结果变量指定为时间格式。
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(hours[,minutes,seconds])。数值。返回与所指示的 hours、minutes 和 seconds 数对应的时间区间。分钟和秒参数可选。如果任何高阶参数为非零数，那么分钟和秒必须解析为小于 60 的数字。除最后非零参数外的所有参数必须解析为整数。例如 TIME.HMS(25.5) 和 TIME.HMS(0,90,25.5) 有效，而 TIME.HMS(25.5,30) 和 TIME.HMS(25,90) 则无效。所有参数都必须解析为全正或全负的值。要将结果显示为时间，请将结果变量指定为时间格式。
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(numexpr[,mult,fuzzbits])。数值。返回向 0 方向截断的 numexpr 值。可选第二个参数 mult 指定结果是此值的整数倍—例如，TRUNC(4.579,0.1) = 4.5。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到最接近的四舍五入边界，但在截断之前被四舍五入。例如，如果 numexpr 在 1.4 到 1.5 之间，mult 是 0.1，那么 fuzzbits 会指定 numexpr 与 1.5 的接近程度（最接近的边界），并被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(numexpr[,mult,fuzzbits])。数值。返回向 0 方向截断的 numexpr 值。可选第二个参数 mult 指定结果是此值的整数倍—例如，TRUNC(4.579,0.1) = 4.5。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到最接近的四舍五入边界，但在截断之前被四舍五入。例如，如果 numexpr 在 1.4 到 1.5 之间，mult 是 0.1，那么 fuzzbits 会指定 numexpr 与 1.5 的接近程度（最接近的边界），并被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(numexpr[,mult,fuzzbits])。数值。返回向 0 方向截断的 numexpr 值。可选第二个参数 mult 指定结果是此值的整数倍—例如，TRUNC(4.579,0.1) = 4.5。值必须是数值，但不能为 0。默认值是 1。可选的第三个参数 fuzzbits 是最不显著的位数，numexpr 可能未达到最接近的四舍五入边界，但在截断之前被四舍五入。例如，如果 numexpr 在 1.4 到 1.5 之间，mult 是 0.1，那么 fuzzbits 会指定 numexpr 与 1.5 的接近程度（最接近的边界），并被四舍五入。如果省略，则使用 FUZZBITS 的系统设置（安装时设为 6）。
upcase16=16@Upcase@UPCASE(?)@UPCASE(strexpr)。字符串。返回 strexpr，同时小写字母都更改为大写字母而其他字符不变。
value10=10@Value@VALUE(?)@VALUE(variable)。数值或字符串。返回 variable 的值，忽略用户对 variable 的缺失值定义，variable 必须是一个变量名或对变量名的矢量引用。
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(varname)。字符串。返回变量的值的值标签；如果值没有标签，则返回空字符串。varname 的值必须是一个变量名，不可以是一个表达式。
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(numexpr,numexpr[,..])。数值。返回其具有有效值的参数的方差。此函数需要两个或更多参数，这些参数必须为数值。您可以指定有效参数的最小数目，以对此函数求值。
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(datevalue)。数值。从代表日期的数值中返回日期部分。参数可以是数字、日期格式变量或解析为日期的表达式。要将结果显示为日期，请将变量指定为日期格式。
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime)。数值。从代表时间或日期时间的值中返回小时（0 到 23 之间的整数）。参数可以是数字、时间或日期时间变量或解析为时间或日期时间值的表达式。
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(datevalue)。数值。从代表日期的数值中返回一年当中的日期（1 到 366 之间的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(datevalue)。数值。从代表日期的数值中返回月份中的日期（1 到 31 之间的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime)。数值。从代表时间或日期时间的值中返回分钟（0 到 59 之间的整数）。参数可以是数字、时间或日期时间变量或解析为时间或日期时间值的表达式。
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(datevalue)。数值。从代表日期的数值中返回月份（1 到 12 之间的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(datevalue)。数值。从代表日期的数值中返回一年当中的季度（1 到 4 之间的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime)。数值。从代表时间或日期时间的值中返回秒（0 到 60 之间的数值）。参数可以是数字、时间或日期时间变量或解析为时间或日期时间值的表达式。
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。数值。从代表时间区间的数值中返回整天数（整数）。参数可以是数字、日期格式变量或解析为时间区间的表达式。
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。数值。从代表时间区间的数值中返回整天数（整数）。参数可以是数字、日期格式变量或解析为时间区间的表达式。
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime)。数值。从代表时间或日期时间的值中返回时间部分。参数可以是数字、时间或日期时间变量或解析为时间或日期时间值的表达式。要将结果显示为时间，请将变量指定为时间格式。
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(datevalue)。数值。从代表日期的数值中返回星期数（1 到 53 的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(datevalue)。数值。从代表日期的数值中返回星期（代表星期天的 1 和代表星期六的 7 之间的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(datevalue)。数值。从代表日期的数值返回年份（四位的整数）。参数可以是数字、日期格式变量或解析为日期的表达式。
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(year,month,day)。数值。返回从 1582 年 10 月 15 日开始一直到参数 year、month 和 day 所代表的日期为止的天数，这三个参数必须为可构成自 1582 年 10 月 15 日以来的有效日期的整数。两位数的 year 值将采用基于“选项”设置（“编辑”菜单，“选项”，“数据”选项卡）的世纪。默认情况下，两位数的 year 的取值范围如下：从当前日期之前的 69 年开始，到当前日期之后的 30 年结束。默认情况下，两位数字年份假设从当前日期的前 69 年到后 30 年这一范围。
